app/controllers/locations_controller.rb

  def show
    if params[:tinyurl]
      begin
        location = Location.find_by_id(params[:tinyurl].to_i(36))
---
SELECT * FROM "locations" WHERE ("locations"."id" IS NULL) LIMIT 1

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
        flash[:notice] = 'Location was successfully created.'
        format.html { redirect_to(@location) }
        format.xml  { render :xml => @location, :status => :created, :location => @location }
      else
        format.html {
          loc = Location.find_by_url(params[:location][:url])
---
INSERT INTO "locations" ("updated_at", "url", "created_at") VALUES('2009-01-07 09:42:21', 'http://ecampus.ifp-school.com/notes/LoginInit.do', '2009-01-07 09:42:21')
SELECT "locations".id FROM "locations" WHERE ("locations"."url" = 'http://www.homecinesolutions.fr/') LIMIT 1

  def update
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)