app/controllers/redirect_controller.rb

SELECT * FROM "locations" WHERE ("locations"."id" = '5') LIMIT 1
---
  def do
    @tinyurl = params[:tinyurl]
    location = Location.find(params[:tinyurl])